In [2]:
import numpy as np
import pandas as pd

In [4]:
data={'COMPANY':['GOOGLE','MICROSOFT','MICROSOFT','MICROSOFT','GOOGLE','FB','FB','GOOGLE'],
     'EMPLOYEE':['SUNIL','SUSHANT','ADAMS','COLINS','BRYANS','TIMON','USMAN','ANDREW'],
     'SALARIES':[2000,12333,4567,599,30953,3454,1568,92586]}

In [6]:
df=pd.DataFrame(data)

In [7]:
df

     COMPANY EMPLOYEE  SALARIES
0     GOOGLE    SUNIL      2000
1  MICROSOFT  SUSHANT     12333
2  MICROSOFT    ADAMS      4567
3  MICROSOFT   COLINS       599
4     GOOGLE   BRYANS     30953
5         FB    TIMON      3454
6         FB    USMAN      1568
7     GOOGLE   ANDREW     92586

In [12]:
df.groupby('COMPANY').describe().transpose()

COMPANY                  FB        GOOGLE     MICROSOFT
SALARIES count     2.000000      3.000000      3.000000
         mean   2511.000000  41846.333333   5833.000000
         std    1333.603389  46265.044930   5968.563981
         min    1568.000000   2000.000000    599.000000
         25%    2039.500000  16476.500000   2583.000000
         50%    2511.000000  30953.000000   4567.000000
         75%    2982.500000  61769.500000   8450.000000
         max    3454.000000  92586.000000  12333.000000

In [14]:
df.groupby('COMPANY').describe().transpose().loc['SALARIES'].loc['count']

COMPANY
FB           2.0
GOOGLE       3.0
MICROSOFT    3.0
Name: count, dtype: float64

In [15]:
df.groupby('COMPANY').describe().transpose().loc['SALARIES'].loc['std']

COMPANY
FB            1333.603389
GOOGLE       46265.044930
MICROSOFT     5968.563981
Name: std, dtype: float64

In [16]:
df.groupby('COMPANY').describe().transpose().loc['SALARIES'].loc['max']

COMPANY
FB            3454.0
GOOGLE       92586.0
MICROSOFT    12333.0
Name: max, dtype: float64

In [17]:
df

     COMPANY EMPLOYEE  SALARIES
0     GOOGLE    SUNIL      2000
1  MICROSOFT  SUSHANT     12333
2  MICROSOFT    ADAMS      4567
3  MICROSOFT   COLINS       599
4     GOOGLE   BRYANS     30953
5         FB    TIMON      3454
6         FB    USMAN      1568
7     GOOGLE   ANDREW     92586

In [18]:
df.groupby('COMPANY').mean()

               SALARIES
COMPANY
FB          2511.000000
GOOGLE     41846.333333
MICROSOFT   5833.000000

In [19]:
df.groupby('COMPANY').std()

               SALARIES
COMPANY
FB          1333.603389
GOOGLE     46265.044930
MICROSOFT   5968.563981

In [20]:
df.groupby('COMPANY').sum()

           SALARIES
COMPANY
FB             5022
GOOGLE       125539
MICROSOFT     17499

In [21]:
df.groupby('COMPANY').max()

          EMPLOYEE  SALARIES
COMPANY
FB           USMAN      3454
GOOGLE       SUNIL     92586
MICROSOFT  SUSHANT     12333

In [23]:
df.groupby('COMPANY').min()

          EMPLOYEE  SALARIES
COMPANY
FB           TIMON      1568
GOOGLE      ANDREW      2000
MICROSOFT    ADAMS       599

In [22]:
df.groupby('COMPANY').count()

           EMPLOYEE  SALARIES
COMPANY
FB                2         2
GOOGLE            3         3
MICROSOFT         3         3